puts '                                     Создание виртуальной машины'

# Если в Биосе не подключена поддержка виртуализации, то не получится создать ВМ, предварительно нужно будет зайти в Биос и подключить


# Можно изменить папку где будут храниться виртуальные машины на другую:
# Инструменты -> Настройки -> Общие -> Папка для машин по умолчанию


# 1. "Создать/New" - (синяя звездочка) кнопка в разделе "Инструменты", которая начнет(откроет подменю) создание виртуальной машины

# 2. Выбираем название виртуальной машины в появившимся окне, можно любое, но если ввести название операционной системы, что будет использоваться на этой виртуальной машине(например Ubuntu) то тип и версия операционной системы подберутся автоматически

# 3. Далее укажем объем оперативной памяти выделяемый физическим компьютером под нашу виртуальную машину.

# 4. Создадим новый виртуальный жеский диск для нашей виртуальной машины, так же можно указать его тип (можно по умолчанию оставить VirtualBoxDiscImage).
# Так же можно выбрать тип диска:
# 'динамический'(может использовать больше или меньше заданной выделенной памяти от физического диска)
# 'фиксированный'(будет занимать именно столько памяти сколько мы выделили)

# 5. Нажимаем 'готово/создать' наша виртуальная машина будет создана и появится ее раздел рядом с разделом "Инструменты"

















# 
