puts '                                          Docker desctop'

# Docker desctop  - приложение с графическим интерфейсом для Докера

# скопировать - 2 прямоугольничка в конце строки

# Новые приложения после скачивания появляются во вкладке Containers.
# Там же в таблице можно посмотреть запущено ли оно(running), какие порты использует, когда начало работу, а так же опции для работы с ним(удаление пауза запуск в терминале итд)

# Помимо самого контейнера/приложения так же был добавлен образ(вкладка Images)
# in use - запущен/используется тоесть создан контейнер по этому образу.
# Tag - версия образа
# Там же есть опции для образа - запустить(если еще не запущен) скачать, пушнуть в хаб(мето где хранятся все образы) или удалить



puts '                                            Portainer'

# https://www.portainer.io/

# https://docs.portainer.io/start/install/server               установка бесплатной версии
# https://docs.portainer.io/start/install/server/docker/linux

# https://www.youtube.com/watch?v=O8N1lvkIjig       (4-32-00) Гайд по установке и использованию

# Portainer - популярный графический интерфейс для работы с Докером, он сам запускается в Докер-контейнере



















#
