puts '                                          Docker desctop'

# Docker desctop  - специальная программа/приложение докера

# скопировать - 2 прямоугольничка в конце строки

# Новые приложения после скачивания появляются во вкладке Containers.
# Там же в таблице можно посмотреть запущено ли оно(running), какие порты использует, когда начало работу, а так же опции для работы с ним(удаление пауза запуск в терминале итд)

# Помимо самого контейнера/приложения так же был добавлен образ(вкладка Images)
# in use - запущен/используется тоесть создан контейнер по этому образу.
# Tag - версия образа
# Там же есть опции для образа - запустить(если еще не запущен) скачать, пушнуть в хаб(мето где хранятся все образы) или удалить
